app/views/businesses/_business.html.haml

  %h5.list-group-item-heading #{business.name}
  - if business.reviews.any?
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1  ORDER BY created_at DESC LIMIT 1  [["business_id", 6]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."business_id" = $1 LIMIT 1  [["business_id", 7]]