app/views/businesses/search.html.haml

  .panel-body
    %p We found #{pluralize(@search_results.count, 'business')} related to your search:
---
SELECT COUNT(1 business) FROM "businesses" WHERE (name ILIKE '%docker%')