app/controllers/businesses_controller.rb

  def index
    @businesses = Business.limit 10
---
SELECT  "businesses".* FROM "businesses"  ORDER BY "businesses"."id" DESC LIMIT 10

  def show
    @business = Business.find params[:id]
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 4]]

  def create
    @business = Business.new business_params
    if @business.save
---
INSERT INTO "businesses" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "FIFA"], ["created_at", "2016-03-01 19:01:46.517863"], ["updated_at", "2016-03-01 19:01:46.517863"]]