app/controllers/reviews_controller.rb

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 6]]
INSERT INTO "reviews" ("body", "user_id", "business_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "will this show?"], ["user_id", 1], ["business_id", 6], ["created_at", "2016-03-02 01:28:38.761623"], ["updated_at", "2016-03-02 01:28:38.761623"]]
---
  def create
    @business = Business.find params[:business_id]
    @review = @business.reviews.new review_params.merge!(user: current_user)
    if @review.save

SELECT  "reviews".* FROM "reviews"  ORDER BY created_at DESC LIMIT 10
---
  def index
    @reviews = Review.limit 10