app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "riggsaaron"], ["email", "riggs.aaron@gmail.com"], ["password_digest", "$2a$10$cA9LWcaCnpNj0POPPul2meDfky81G7/G2uapwCyO8pfX4e7mV8Vg."]]